In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv("timeSpent.csv") 
df2 = pd.read_csv("cost.csv")

In [3]:
df1.head()

      users   timeSpent
0  Sushmita   31.266056
1      Adam   17.900529
2     Benny  265.236086
3    Anurag   42.470696

In [4]:
df2.head()

      users  cost
0      Adam  20.0
1    Anurag   NaN
2     Benny  15.0
3  Sushmita   2.0
4   Apoorva   7.0

In [5]:
df = df1.merge(df2, on="users", how="left")
df.head()

      users   timeSpent  cost
0  Sushmita   31.266056   2.0
1      Adam   17.900529  20.0
2     Benny  265.236086  15.0
3    Anurag   42.470696   NaN

In [6]:
df=df.fillna(0)
df.head()

      users   timeSpent  cost
0  Sushmita   31.266056   2.0
1      Adam   17.900529  20.0
2     Benny  265.236086  15.0
3    Anurag   42.470696   0.0

In [7]:
df.describe()

        timeSpent       cost
count    4.000000   4.000000
mean    89.218342   9.250000
std    117.774200   9.776673
min     17.900529   0.000000
25%     27.924674   1.500000
50%     36.868376   8.500000
75%     98.162044  16.250000
max    265.236086  20.000000